In [1]:
import pandas as pd
import numpy as np

In [2]:
# A common practice is to create a path variable to pass to read_csv
path = r"C:\Users\Zana\Desktop\pandas\retail\transactions.csv"

# read in trasactions csv and create DataFrame
transactions = pd.read_csv(path)

# return DataFrame (df)
transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [3]:
# shape of df: 84388 rows, 3 columns (not including index)
transactions.shape

(83488, 3)

In [4]:
# shape of df: 84388 rows. Add 1 to max default index value to get row count
transactions.index.max() + 1

83488

In [5]:
# dtypes attribute returns column names and their data types
transactions.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

In [6]:
# Look at top 5 rows with .head()
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [7]:
# use .isna().sum() on df to get missing counts for all columns

transactions.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [8]:
# Use info to determine missing counts - none are missing!
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [9]:
# Use describe to return the specified aggregations (and more!)
transactions.describe()

          store_nbr  transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000

In [10]:
# Method 1 for unique dates - once you know how to access columns :D
transactions["date"].nunique()

1682

In [11]:
# Method 2 for unique dates - speecify include="all" to get stats on text columns.

transactions.describe(include="all")

              date     store_nbr  transactions
count        83488  83488.000000  83488.000000
unique        1682           NaN           NaN
top     2017-08-15           NaN           NaN
freq            54           NaN           NaN
mean           NaN     26.939237   1694.602158
std            NaN     15.608204    963.286644
min            NaN      1.000000      5.000000
25%            NaN     13.000000   1046.000000
50%            NaN     27.000000   1393.000000
75%            NaN     40.000000   2079.000000
max            NaN     54.000000   8359.000000

In [12]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [13]:
# skip the first row via slicing

transactions.loc[1:, "store_nbr":"transactions"]

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [14]:
# calculate sum of store number column

transactions.loc[:, "store_nbr"].nunique()

54

In [15]:
# Divide sum of transactions by millions to get in units of millions

transactions.loc[:, "transactions"].sum() / 1000000

141.478945

In [16]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [17]:
# drop the first row of data in place

transactions.drop(0, axis=0, inplace=True)

transactions

             date  store_nbr  transactions
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
5      2013-01-02          5          1903
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83487 rows x 3 columns]

In [18]:
# drop date but not in place

transactions.drop("date", axis=1)

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [19]:
# drop duplicate rows subsetting by store number. keep last entry for each store

transactions.drop_duplicates(subset="store_nbr", keep="last").head()

             date  store_nbr  transactions
83434  2017-08-15          1          1693
83435  2017-08-15          2          1737
83436  2017-08-15          3          2956
83437  2017-08-15          4          1283
83438  2017-08-15          5          1310

In [21]:
oil = pd.read_csv(r"C:\Users\Zana\Desktop\pandas\retail\oil.csv")

In [22]:
# info can be used to infer missing counts 1218 - 1175 = 43

oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [23]:
# But usually easier to use isna().sum() - let the computer count for you :D

oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [24]:
# calculate mean of oil series after filling missing values with 0

oil.loc[:, 'dcoilwtico'].fillna(0).mean()

65.32379310344835

In [25]:
# calculate mean of oil series after filling missing values with the mean of oil price

oil.loc[:, 'dcoilwtico'].fillna(oil.loc[:, 'dcoilwtico'].mean()).mean()

67.71436595744696

In [26]:
transactions.head()

         date  store_nbr  transactions
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922
5  2013-01-02          5          1903

In [27]:
# all stores > 2500 percentage occurence
(transactions['transactions'] > 2000).mean()

0.266808006036868

In [28]:
# Number of times store 25 had > 2000 divided by total days for store 25 to get percent of time it happened

mask = (transactions['transactions'] > 2000) & (transactions['store_nbr'] == 25)

(transactions.loc[mask, 'transactions'].count() 
 / transactions.loc[(transactions['store_nbr'] == 25), 'transactions'].count())

0.03469640644361834

In [29]:
# Sum of transactions where store 25 had > 2000 transactions
transactions.loc[mask, 'transactions'].sum()

144903

In [30]:
# sum of transactions for stores 25 and 31 in months May and June on days they had less than 2000 transactions

(transactions.query(
    "store_nbr in [25, 31] & date.str[6] in ['5', '6'] & transactions < 2000")
 .loc[:, "transactions"]
 .sum())

644910

In [31]:
# sum of transactions for stores 25 and 31 in months May and June on days they had less than 2000 transactions

(transactions.query(
    "store_nbr in [25, 31] & date.str[6] in ['5', '6'] & transactions < 2000")
 .loc[:, "transactions"]
 .sum())

644910

In [32]:
# Sort dataframe by date in ascending order, and trasactions in descending order

transactions.sort_values(['date', 'transactions'], ascending=[True, False])

             date  store_nbr  transactions
40     2013-01-02         46          4886
38     2013-01-02         44          4821
39     2013-01-02         45          4208
41     2013-01-02         47          4161
11     2013-01-02         11          3547
...           ...        ...           ...
83455  2017-08-15         22           766
83449  2017-08-15         16           742
83465  2017-08-15         32           615
83468  2017-08-15         35           612
83459  2017-08-15         26           534

[83487 rows x 3 columns]

In [33]:
# sort columns in reverse alphabetical order using sort_index on the column axis (1), in descending order

transactions.sort_index(axis=1, ascending=False)

       transactions  store_nbr        date
1              2111          1  2013-01-02
2              2358          2  2013-01-02
3              3487          3  2013-01-02
4              1922          4  2013-01-02
5              1903          5  2013-01-02
...             ...        ...         ...
83483          2804         50  2017-08-15
83484          1573         51  2017-08-15
83485          2255         52  2017-08-15
83486           932         53  2017-08-15
83487           802         54  2017-08-15

[83487 rows x 3 columns]

In [34]:
transactions.head()

         date  store_nbr  transactions
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922
5  2013-01-02          5          1903

In [37]:
print(transactions.columns)

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [38]:
# Target based columns
transactions["pct_to_target"] = transactions.loc[:, "transactions"] / 2500
transactions["met_target"] = transactions.loc[:, "pct_to_target"] >= 1
transactions["bonus_payable"] = 100 * transactions["met_target"]

# Date Columns
transactions["date"] = pd.to_datetime(transactions["date"])
transactions["month"] = transactions["date"].dt.month
transactions["day_of_week"] = transactions["date"].dt.dayofweek

print(transactions.head())

        date  store_nbr  transactions  pct_to_target  met_target  \
1 2013-01-02          1          2111         0.8444       False
2 2013-01-02          2          2358         0.9432       False
3 2013-01-02          3          3487         1.3948        True
4 2013-01-02          4          1922         0.7688       False
5 2013-01-02          5          1903         0.7612       False

   bonus_payable  month  day_of_week
1              0      1            2
2              0      1            2
3            100      1            2
4              0      1            2
5              0      1            2

In [39]:
# Ensure that the 'month' and 'day_of_week' columns are already created
transactions["month"] = transactions["date"].dt.month
transactions["day_of_week"] = transactions["date"].dt.dayofweek

# Set up the three conditions
conditions = [
    transactions["month"] == 12,
    (transactions["month"] == 5) & (transactions["day_of_week"] == 6),
    (transactions["month"] == 7) & (transactions["day_of_week"] == 0)
]

# Specify outcomes for each condition
choices = ["Holiday Bonus", "Corporate Month", "Summer Special"]

# Call the np.select method, passing in conditions, choices, and a default value of 'None' if no condition is met
transactions["seasonal_bonus"] = np.select(conditions, choices, default="None")

# Display the first few rows of the DataFrame to verify
transactions.head()

,date,store_nbr,transactions,pct_to_target,met_target,bonus_payable,month,day_of_week,seasonal_bonus
1,2013-01-02,1,2111,0.8444,False,0,1,2,None
2,2013-01-02,2,2358,0.9432,False,0,1,2,None
3,2013-01-02,3,3487,1.3948,True,100,1,2,None
4,2013-01-02,4,1922,0.7688,False,0,1,2,None
5,2013-01-02,5,1903,0.7612,False,0,1,2,None

In [40]:
# look at frequency for each 
transactions["seasonal_bonus"].value_counts()

None               75258
Holiday Bonus       6028
Summer Special      1103
Corporate Month     1098
Name: seasonal_bonus, dtype: int64

In [41]:
# Use value counts to extract counts of each holiday, 
# slice the series returned by value counts, and sum relevant values before multiply by 100 to get bonus owed

transactions.loc[:, "seasonal_bonus"].value_counts().iloc[1:].sum() * 100

822900

In [42]:
# Drop columns we created in prior exercises
transactions = transactions.drop(
    [
        "pct_to_target",
        "met_target",
        "bonus_payable",
        "month",
        "day_of_week",
        "seasonal_bonus",
    ],
    axis=1,
)

transactions.head()

        date  store_nbr  transactions
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922
5 2013-01-02          5          1903

In [45]:
# Create new columns using the assign method

transactions = transactions.assign(
    target_pct = transactions["transactions"] / 2500,  # Calculate percentage of target achieved
    met_target = (transactions["transactions"] / 2500) >= 1,  # Check if target is met
    bonus_payable = ((transactions["transactions"] / 2500) >= 1) * 100,  # Determine bonus payable
    month = transactions.date.dt.month,  # Extract month from date
    day_of_week = transactions.date.dt.dayofweek,  # Extract day of the week from date
    seasonal_bonus = np.select(conditions, choices, default="None"),  # Assign seasonal bonus based on conditions
)

In [46]:
# Same method as assignment 10

transactions.loc[:, "seasonal_bonus"].value_counts().iloc[1:].sum() * 100

822900

In [47]:
transactions.head()

,date,store_nbr,transactions,target_pct,met_target,bonus_payable,month,day_of_week,seasonal_bonus
1,2013-01-02,1,2111,0.8444,False,0,1,2,None
2,2013-01-02,2,2358,0.9432,False,0,1,2,None
3,2013-01-02,3,3487,1.3948,True,100,1,2,None
4,2013-01-02,4,1922,0.7688,False,0,1,2,None
5,2013-01-02,5,1903,0.7612,False,0,1,2,None

In [48]:
transactions.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83487 entries, 1 to 83487
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            83487 non-null  datetime64[ns]
 1   store_nbr       83487 non-null  int64
 2   transactions    83487 non-null  int64
 3   target_pct      83487 non-null  float64
 4   met_target      83487 non-null  bool
 5   bonus_payable   83487 non-null  int32
 6   month           83487 non-null  int64
 7   day_of_week     83487 non-null  int64
 8   seasonal_bonus  83487 non-null  object
dtypes: bool(1), datetime64[ns](1), float64(1), int32(1), int64(4), object(1)
memory usage: 9.2 MB

In [49]:
transactions.head()

,date,store_nbr,transactions,target_pct,met_target,bonus_payable,month,day_of_week,seasonal_bonus
1,2013-01-02,1,2111,0.8444,False,0,1,2,None
2,2013-01-02,2,2358,0.9432,False,0,1,2,None
3,2013-01-02,3,3487,1.3948,True,100,1,2,None
4,2013-01-02,4,1922,0.7688,False,0,1,2,None
5,2013-01-02,5,1903,0.7612,False,0,1,2,None

In [50]:
# down to 2.9MB vs. 10.1 to start. Will work on Chandler's grandparents computer!
transactions.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83487 entries, 1 to 83487
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            83487 non-null  datetime64[ns]
 1   store_nbr       83487 non-null  int64
 2   transactions    83487 non-null  int64
 3   target_pct      83487 non-null  float64
 4   met_target      83487 non-null  bool
 5   bonus_payable   83487 non-null  int32
 6   month           83487 non-null  int64
 7   day_of_week     83487 non-null  int64
 8   seasonal_bonus  83487 non-null  object
dtypes: bool(1), datetime64[ns](1), float64(1), int32(1), int64(4), object(1)
memory usage: 9.2 MB